[
    {
        "image": "https://i.ibb.co/PwtGSr3/agriculture-6.jpg",
        "title": "Collecting fresh and healthy crops from organizing farm",
        "description": "The primary purpose of agricultural land is for the production of food, fiber, and other agricultural products. This includes the cultivation of crops such as grains, vegetables, fruits, and nuts, as well as the raising of livestock for meat, dairy, and other products. Agricultural land may also be used for activities such as aquaculture, forestry, and horticulture."
    },
    {
        "image": "https://i.ibb.co/tqknw16/agriculture-19.jpg",
        "title": "Wide agricultural land for farmers to cultivate crops",
        "description": " Agricultural land can vary greatly in terms of its physical attributes. It may consist of flat plains, rolling hills, or even steep slopes. The soil composition can also vary, with some areas having fertile soil ideal for farming, while others may require more intensive cultivation methods or soil improvement techniques."
    },
    {
        "image": "https://i.ibb.co/NtzcyB6/agriculture-24.jpg",
        "title": "Water buffalo important for dairy farming in South Asia.",
        "description": "Dairy farming is a branch of agriculture focused on the production of milk and dairy products from animals such as cows, goats, sheep, and buffaloes. It plays a vital role in providing nutritious food products like milk, cheese, butter, yogurt, and ice cream."
    },
    {
        "image": "https://i.ibb.co/Xp0H8xs/agriculture-25.jpg",
        "title": "Farmers face challenges in unusual weather.",
        "description": "The primary purpose of agricultural land is for the production of food, fiber, and other agricultural products. This includes the cultivation of crops such as grains, vegetables, fruits, and nuts, as well as the raising of livestock for meat, dairy, and other products. Agricultural land may also be used for activities such as aquaculture, forestry, and horticulture."
    },
    {
        "image": "https://i.ibb.co/hmQWPZw/agriculture-4.jpg",
        "title": "Foods encompass a vast array of edible substances consumed by humans.",
        "description": "Technological advancements, such as precision agriculture, genetically modified crops, and automated machinery, have transformed the way agricultural land is managed and cultivated. These innovations have the potential to increase efficiency, productivity, and sustainability in agriculture."
    }
]